In [1]:
import numpy as np
import pandas as pd
pd.set_option('float_format', '{:.2f}'.format)
# line 3 limits floats to two decimal points (comment it out if neccessary / desired)

In [2]:
np.nan
# not a number

nan

In [3]:
pd.NA

In [4]:
pd.NaT
# not a timestap

NaT

In [7]:
myvar = np.nan
myvar == np.nan
# there is no way to tell if two missing values are identical

False

In [8]:
myvar is np.nan
# checks if variable is a missing value

True

In [10]:
df = pd.read_csv('./course-data/movie_scores.csv')
df
# the second row is missing all values
# Hugh Jackman has no scores

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00    m             8.00             10.00
1        NaN       NaN   nan  NaN              nan               nan
2       Hugh   Jackman 51.00    m              nan               nan
3      Oprah   Winfrey 66.00    f             6.00              8.00
4       Emma     Stone 31.00    f             7.00              9.00

In [15]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [13]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [17]:
df['pre_movie_score'].notnull()

0     True
1    False
2    False
3     True
4     True
Name: pre_movie_score, dtype: bool

In [18]:
df[df['pre_movie_score'].notnull()]
# we can do conditional filtering 
# we get back only the rows that do have a pre-movie score
# we can use the notnull() method for conditional fultering to select columns where
# certain features are present

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [21]:
df[df['pre_movie_score'].isnull() & df['first_name'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman 51.00   m              nan               nan

In [ ]:
# KEEP DATA - check

# DROP DATA 
# call help(df.dropna) to be view detailed explanation!

# FILL DATA

In [23]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [26]:
df.dropna(thresh=4)
# drop all the rows that have NA unless they have at least one non-NA value

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
2       Hugh   Jackman 51.00   m              nan               nan
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [27]:
df.dropna(thresh=5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [28]:
df.dropna(axis=1)
# because of the all-NA row, all the columns -but the index- are dropped

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [29]:
df.dropna(subset=['last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
2       Hugh   Jackman 51.00   m              nan               nan
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   first_name        4 non-null      object
 1   last_name         4 non-null      object
 2   age               4 non-null      float64
 3   sex               4 non-null      object
 4   pre_movie_score   3 non-null      float64
 5   post_movie_score  3 non-null      float64
dtypes: float64(3), object(3)
memory usage: 368.0+ bytes